app/Controllers/ActionController.php

SELECT `b`.`Details`, `b`.`Code`, `b`.`DateCreated`, `c`.`clusterName`, `d`.`schoolName`, `e`.`subjectName`, `f`.`ImplementationDate`
FROM `tblreview` `a`
LEFT JOIN `tblform` `b` ON `b`.`formID`=`a`.`formID`
LEFT JOIN `tblcluster` `c` ON `c`.`clusterID`=`b`.`clusterID`
LEFT JOIN `tblschool` `d` ON `d`.`schoolID`=`b`.`schoolID`
LEFT JOIN `tblsubject` `e` ON `e`.`subjectID`=`b`.`subjectID`
LEFT JOIN `tblaction` `f` ON `f`.`formID`=`b`.`formID`
WHERE `a`.`accountID` = '5'
AND   (
`b`.`Details` LIKE '%2025-02-%' ESCAPE '!'
OR  `b`.`Code` LIKE '%2025-02-%' ESCAPE '!'
OR  `b`.`DateCreated` LIKE '%2025-02-%' ESCAPE '!'
OR  `c`.`clusterName` LIKE '%2025-02-%' ESCAPE '!'
OR  `d`.`schoolName` LIKE '%2025-02-%' ESCAPE '!'
OR  `e`.`subjectName` LIKE '%2025-02-%' ESCAPE '!'
OR  `f`.`ImplementationDate` LIKE '%2025-02-%' ESCAPE '!'
 )
GROUP BY `b`.`formID`
---
    public function actionPlan()
    {
        $reviewModel = new \App\Models\reviewModel();
        $user = session()->get('loggedUser');
        $searchTerm = $_GET['search']['value'] ?? '';
        $totalRecords = $reviewModel->WHERE('accountID',$user)->countAllResults();

        $builder = $this->db->table('tblreview a');
        $builder->select("b.Details,b.Code,b.DateCreated,c.clusterName,d.schoolName,e.subjectName,f.ImplementationDate");
        $builder->join('tblform b','b.formID=a.formID','LEFT');
        $builder->join('tblcluster c','c.clusterID=b.clusterID','LEFT');
        $builder->join('tblschool d','d.schoolID=b.schoolID','LEFT');
        $builder->join('tblsubject e','e.subjectID=b.subjectID','LEFT');
        $builder->join('tblaction f','f.formID=b.formID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $builder->groupBy('b.formID');
        if (!empty($searchTerm)) {
            $builder->groupStart() // Start grouping OR conditions
                ->like('b.Details', $searchTerm)
                ->orLike('b.Code', $searchTerm)
                ->orLike('b.DateCreated', $searchTerm)
                ->orLike('c.clusterName', $searchTerm)
                ->orLike('d.schoolName', $searchTerm)
                ->orLike('e.subjectName', $searchTerm)
                ->orLike('f.ImplementationDate', $searchTerm) // Fixed typo here (removed extra dot)
                ->groupEnd(); // End grouping
        }
        $review = $builder->get()->getResult();