app/Controllers/ActionController.php

    public function fetchSchoolData()
    {
        $schoolModel = new \App\Models\schoolModel();
        //schools
        $builder = $this->db->table('tblschool a');
        $builder->select('a.DateCreated,a.schoolName,a.address,a.schoolID,b.clusterName');
        $builder->join('tblcluster b','b.clusterID=a.clusterID','LEFT');
        $builder->groupBy('a.schoolID');
        $school = $builder->get()->getResult();
---
SELECT `a`.`DateCreated`, `a`.`schoolName`, `a`.`address`, `a`.`schoolID`, `b`.`clusterName`
FROM `tblschool` `a`
LEFT JOIN `tblcluster` `b` ON `b`.`clusterID`=`a`.`clusterID`
GROUP BY `a`.`schoolID`

    public function totalReview()
    {
        $user = session()->get('loggedUser');
        $status = [0];
        $builder = $this->db->table('tblreview');
        $builder->select('COUNT(*)as total');
        $builder->WHERE('accountID',$user)->WHEREIN('Status',$status);
        $total = $builder->get()->getRow();
---
SELECT COUNT(*) AS `numrows`
FROM `tblreview`
WHERE `accountID` = '5'