app/Controllers/ActionController.php

SELECT `a`.`DateCreated`, `a`.`schoolName`, `a`.`address`, `a`.`schoolID`, `b`.`clusterName`
FROM `tblschool` `a`
LEFT JOIN `tblcluster` `b` ON `b`.`clusterID`=`a`.`clusterID`
GROUP BY `a`.`schoolID`
---
    public function fetchSchoolData()
    {
        $schoolModel = new \App\Models\schoolModel();
        //schools
        $builder = $this->db->table('tblschool a');
        $builder->select('a.DateCreated,a.schoolName,a.address,a.schoolID,b.clusterName');
        $builder->join('tblcluster b','b.clusterID=a.clusterID','LEFT');
        $builder->groupBy('a.schoolID');
        $school = $builder->get()->getResult();

SELECT `a`.*, `b`.`subjectName`
FROM `tblform` `a`
LEFT JOIN `tblsubject` `b` ON `b`.`subjectID`=`a`.`subjectID`
WHERE `a`.`accountID` = '3'
---
    public function userRequest()
    {
        $formModel = new \App\Models\formModel();

        $user = session()->get('loggedUser');
        $builder = $this->db->table('tblform a');
        $builder->select('a.*,b.subjectName');
        $builder->join('tblsubject b','b.subjectID=a.subjectID','LEFT');
        $builder->WHERE('a.accountID',$user);
        $form = $builder->get()->getResult();