app/Controllers/Home.php

    public function adminDashboard()
    {
        if(session()->get('role')=="Administrator")
        {
            $title = "Dashboard";
            $formModel = new \App\Models\formModel();
            //count all the form
            $totalForm = $formModel->countAllResults();
            //count all the pending
            $pendingForm = $formModel->WHERE('Status<>',1)->countAllResults();
            //count all the resolved
            $resolvedForm = $formModel->WHERE('Status',1)->countAllResults();
            //feedback
            $feedbackModel = new \App\Models\feedbackModel();
            $feed = $feedbackModel->countAllResults();
            //get the total feedback
            $positive = [6,7,8,9,10];
            $negative = [1,2,3,4,5];
            $totalFeedback = $feedbackModel->countAllResults();
            $positiveFeedback = $feedbackModel->WHEREIN('Rate',$positive)->countAllResults();
            $negativeFeedback = $feedbackModel->WHEREIN('Rate',$negative)->countAllResults();
            //generate percentage
            $positivePercent = ($positiveFeedback/$totalFeedback)*100;
            $negativePercent = ($negativeFeedback/$totalFeedback)*100;
            //compute the sum of all rates
            $builder = $this->db->table('tblfeedback');
            $builder->select('sum(Rate)total');
            $sumRate = $builder->get()->getRow();
---
SELECT sum(Rate)total
FROM `tblfeedback`

    public function userAccounts()
    {
        if(session()->get('role')=="Administrator")
        {
            $title = "User Accounts";
            $builder = $this->db->table('tblaccount a');
            $builder->select('a.*,b.clusterName,c.schoolName');
            $builder->join('tblcluster b','b.clusterID=a.clusterID','LEFT');
            $builder->join('tblschool c','c.schoolID=a.schoolID','LEFT');
            $builder->groupBy('a.accountID');
            $account = $builder->get()->getResult();
---
SELECT *
FROM `tblaccount`
WHERE `accountID` = '3'
 LIMIT 1