app/Controllers/Home.php

            //compute the sum of all rates
            $builder = $this->db->table('tblfeedback');
            $builder->select('sum(Rate)total');
            $sumRate = $builder->get()->getRow();
---
SELECT sum(Rate)total
FROM `tblfeedback`

    public function userAccounts()
    {
        if(session()->get('role')=="Administrator")
        {
            $title = "User Accounts";
            //system
            $systemModel = new \App\Models\systemModel();
            $system = $systemModel->first();
            //accounts
            $builder = $this->db->table('tblaccount a');
            $builder->select('a.*,b.clusterName,c.schoolName');
            $builder->join('tblcluster b','b.clusterID=a.clusterID','LEFT');
            $builder->join('tblschool c','c.schoolID=a.schoolID','LEFT');
            $builder->groupBy('a.accountID');
            $account = $builder->get()->getResult();
---
SELECT *
FROM `tblaccount`
WHERE `accountID` = '1'
 LIMIT 1

    public function userFeedback()
    {
        if(session()->get('role')=="User")
        {
            $title = "Feedback";
            //system
            $systemModel = new \App\Models\systemModel();
            $system = $systemModel->first();
            //feedback
            $user = session()->get('loggedUser');
            $builder = $this->db->table('tblform a');
            $builder->select('a.Code,a.DateCreated,a.Details,b.subjectName,c.actionID,c.actionName,c.Recommendation,
            d.Rate,d.Message,f.Fullname');
            $builder->join('tblsubject b','b.subjectID=a.subjectID','LEFT');
            $builder->join('tblaction c','c.formID=a.formID','LEFT');
            $builder->join('tblfeedback d','d.formID=a.formID','LEFT');
            $builder->join('tblreview e','e.formID=a.formID','LEFT');
            $builder->join('tblaccount f','f.accountID=e.accountID','LEFT');
            $builder->WHERE('a.accountID',$user)->WHERE('a.Status',1);
            $builder->groupBy('a.formID');
            $feed = $builder->get()->getResult();
---
SELECT `a`.`Code`, `a`.`DateCreated`, `a`.`Details`, `b`.`subjectName`, `c`.`actionID`, `c`.`actionName`, `c`.`Recommendation`, `d`.`Rate`, `d`.`Message`, `f`.`Fullname`
FROM `tblform` `a`
LEFT JOIN `tblsubject` `b` ON `b`.`subjectID`=`a`.`subjectID`
LEFT JOIN `tblaction` `c` ON `c`.`formID`=`a`.`formID`
LEFT JOIN `tblfeedback` `d` ON `d`.`formID`=`a`.`formID`
LEFT JOIN `tblreview` `e` ON `e`.`formID`=`a`.`formID`
LEFT JOIN `tblaccount` `f` ON `f`.`accountID`=`e`.`accountID`
WHERE `a`.`accountID` = '17'
AND `a`.`Status` = 1
GROUP BY `a`.`formID`