app/Controllers/Home.php

SELECT `a`.*, `b`.`clusterName`, `c`.`subjectName`
FROM `tblaccount` `a`
LEFT JOIN `tblcluster` `b` ON `b`.`clusterID`=`a`.`clusterID`
LEFT JOIN `tblsubject` `c` ON `c`.`subjectID`=`a`.`subjectID`
GROUP BY `a`.`accountID`
---
    public function userAccounts()
    {
        if(session()->get('role')=="Administrator")
        {
            $title = "User Accounts";
            $builder = $this->db->table('tblaccount a');
            $builder->select('a.*,b.clusterName,c.subjectName');
            $builder->join('tblcluster b','b.clusterID=a.clusterID','LEFT');
            $builder->join('tblsubject c','c.subjectID=a.subjectID','LEFT');
            $builder->groupBy('a.accountID');
            $account = $builder->get()->getResult();